turbulenceOptimizer/app/constant/tuneOptParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      tuneOptParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Optimizer stopping controls.
// The optimizer exits early only after the design step, objective drift,
// and constraint violation all remain small for several consecutive loops.
convergenceControl
{
    // Intentionally empty: use solver defaults from createFields.H.
    // Add only non-default overrides here when tuning is needed.
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
